- Database Name :RSQL
- Table Name : score
- id,korean,english,mathematics

- Anaconda Navigator
- rJava, RMySQL 설치하기

In [1]:
library(RMySQL)

Loading required package: DBI

In [2]:
# DB Connection

conn <- dbConnect(MySQL(),
                  dbname='RSQL',
                  user ='root',
                  password='qwer1234',
                  host="127.0.0.1"
)

In [3]:
# 테이블 목록
dbListTables(conn)

[1] "score"

In [4]:
# 테이블의 컬럼 목록
dbListFields(conn,'score')

[1] "id"          "korean"      "english"     "mathematics"

In [5]:
# Select
dbGetQuery(conn,'select count(*)from score')

  count(*)
1 10

In [6]:
dbGetQuery(conn,'select * from score')

   id korean english mathematics
1   1  90     80      70
2   2  90     88      70
3   3  90     89      70
4   4  90     87      70
5   5  90     60      70
6   6 100    100     100
7   7 100    100     100
8   8 100    100     100
9   9 100    100     100
10 10 100    100     100

In [7]:
# insert
dbSendQuery(conn, 'insert into score values(1,100,100,100)')
result = dbGetQuery(conn,'select * from score')
result

   id korean english mathematics
1   1  90     80      70
2   2  90     88      70
3   3  90     89      70
4   4  90     87      70
5   5  90     60      70
6   6 100    100     100
7   7 100    100     100
8   8 100    100     100
9   9 100    100     100
10 10 100    100     100
11  1 100    100     100

In [8]:
dbSendQuery(conn, 'insert into score values(2,90,90,90)')
result = dbGetQuery(conn,'select * from score')
result

   id korean english mathematics
1   1  90     80      70
2   2  90     88      70
3   3  90     89      70
4   4  90     87      70
5   5  90     60      70
6   6 100    100     100
7   7 100    100     100
8   8 100    100     100
9   9 100    100     100
10 10 100    100     100
11  1 100    100     100
12  2  90     90      90

In [9]:
#Update

dbSendQuery(conn, 'update score set korean=90, english=80, mathematics=70 where id=2')
result = dbGetQuery(conn,'select * from score')
result

   id korean english mathematics
1   1  90     80      70
2   2  90     80      70
3   3  90     89      70
4   4  90     87      70
5   5  90     60      70
6   6 100    100     100
7   7 100    100     100
8   8 100    100     100
9   9 100    100     100
10 10 100    100     100
11  1 100    100     100
12  2  90     80      70

In [10]:
#Delete

dbSendQuery(conn, 'delete from score')
result = dbGetQuery(conn,'select * from score')
result

     id korean english mathematics

### MySQL 에 아래 두줄 적고 실행해야 외부 파일 추가 가능 !!!!!!!!!!!!!
SHOW VARIABLES LIKE 'local_infile';   
SET GLOBAL local_infile = 1;

In [11]:
# csv file을 읽어서 MYSQL에 넣기

data <- read.csv("../Data//score.csv", header=F)
colnames(data) <- c('id','korean','english','mathematics')
data

   id korean english mathematics
1   1  90     80      70
2   2  90     88      70
3   3  90     89      70
4   4  90     87      70
5   5  90     60      70
6   6 100    100     100
7   7 100    100     100
8   8 100    100     100
9   9 100    100     100
10 10 100    100     100

In [12]:
dbWriteTable(conn,"score",data,overwrite=T,row.names=F) #append=T

[1] TRUE

In [13]:
result = dbGetQuery(conn,'select * from score')
result

   id korean english mathematics
1   1  90     80      70
2   2  90     88      70
3   3  90     89      70
4   4  90     87      70
5   5  90     60      70
6   6 100    100     100
7   7 100    100     100
8   8 100    100     100
9   9 100    100     100
10 10 100    100     100

In [14]:
str(result)

'data.frame':	10 obs. of  4 variables:
 $ id         : num  1 2 3 4 5 6 7 8 9 10
 $ korean     : num  90 90 90 90 90 100 100 100 100 100
 $ english    : num  80 88 89 87 60 100 100 100 100 100
 $ mathematics: num  70 70 70 70 70 100 100 100 100 100

In [15]:
data2 <- read.csv("../Data/score2.csv", header=F)
colnames(data2) <- c('id','korean','english','mathematics')
data2

  id korean english mathematics
1 11 90     80      70
2 12 90     88      70

In [16]:
dbWriteTable(conn,"score",data2,overwrite=F,row.names=F,append=T) #append=T 추가한다는 의미

[1] TRUE

In [17]:
result = dbGetQuery(conn,'select * from score')
result

   id korean english mathematics
1   1  90     80      70
2   2  90     88      70
3   3  90     89      70
4   4  90     87      70
5   5  90     60      70
6   6 100    100     100
7   7 100    100     100
8   8 100    100     100
9   9 100    100     100
10 10 100    100     100
11 11  90     80      70
12 12  90     88      70

In [18]:
# Disconnect (연결 끊는 거)
dbDisconnect(conn)

[1] TRUE